AbbToAll = {
    '京': '北京市',
    '津': '天津市',
    '沪': '上海市',
    '渝': '重庆市',
    '冀': '石家庄',
    '豫': '河南省',
    '鄂': '湖北省',
    '湘': '湖南省',
    '苏': '江苏省',
    '赣': '江西省',
    '黑': '黑龙江省',
    '吉': '吉林省',
    '辽': '辽宁省',
    '陕': '陕西省',
    '秦': '陕西省',
    '晋': '山西省',
    '鲁': '山东省',
    '川': '四川省',
    '蜀': '四川省',
    '青': '青海省',
    '皖': '安徽省',
    '琼': '海南省',
    '粤': '广东省',
    '贵': '贵州省',
    '黔': '贵州省',
    '浙': '浙江省',
    '闽': '福建省',
    '台': '台湾省',
    '甘': '甘肃省',
    '陇': '甘肃省',
    '云': '云南省',
    '滇': '云南省',
    '藏': '西藏自治区',
    '宁': '宁夏省',
    '桂': '广西壮族自治区',
    '新': '新疆维吾尔自治区',
    '内蒙古': '内蒙古自治区',
    '港': '香港自治区',
    '澳': '澳门自治区'
}

AllToAbb = {
    '四川': '川',
    '四川': '蜀',
    '青海': '青',
    '安徽': '皖',
    '海南': '琼',
    '广东': '粤',
    '贵州': '贵',
    '贵州': '黔',
    '浙江': '浙',
    '福建': '闽',
    '台湾': '台',
    '甘肃': '甘',
    '甘肃': '陇',
    '云南': '云',
    '云南': '滇',
    '西藏': '藏',
    '宁夏': '宁',
    '广西': '桂',
    '新疆': '新',
    '内蒙古': '内蒙古',
    '香港': '港',
    '澳门': '澳',
}

while True:
    print('''请选择模式：
    1为由简称到全称，
    2为由通俗说法到简称。''')

    choose = int(input('>'))
    
    if choose == 1:
        print("请输入你要查询的省份简称:")
        abb = input('>')
        print(f"{abb} 的全称为{AbbToAll[abb]}\n")

    if choose == 2:
        print("请输入你要查询的省份通俗说法(如内蒙古，吉林，西藏等):")
        all = input('>')
        print(f"{AbbToAll[AllToAbb[all]]} 的简称是{AllToAbb[all]}\n")

